source_data = [
    {
        "rima_id": 603517,
        "slug": "2016-12-22-meduza-578412-vo-frantsii-osvobozhden-rossiiskii-bolel-shchik-osuzhdennyi",
        "source_slug": "meduza",
        "title": "Во Франции освобожден российский болельщик, осужденный за беспорядки на Евро-2016",
        "mapped_genre": "Новости",
        "published_dt": "2016-12-22 13:03:54+00",
        "plain_text": "Россиянин Николай Морозов, приговоренный во Франции к лишению свободы за участие в беспорядках на Евро-2016, освобожден из тюрьмы. Об этом сообщил консул генерального консульства РФ в Марселе Даниил Болтакс. По словам дипломата, ожидается, что в январе 2017 года на свободу выйдет еще один россиянин, осужденный за беспорядки во время чемпионата Европы по футболу, — Алексей Ерунов. Третий российский болельщик — Сергей Горбачев — мог быть освобожден до Нового года, однако решил остаться в тюрьме до января в знак солидарности с Еруновым, сообщает Sports.Ru. «Николай Морозов освобожден из-под стражи и возвращается в Россию. Сейчас он находится в самолете или уже в небе над Францией», — сообщил дипломат. Sports.ru 11 июня в Марселе, где в рамках Евро-2016 играли сборные России и Англии, российские болельщики устроили несколько драк с англичанами и беспорядки на трибуне стадиона. В результате столкновений между российским и английскими болельщиками пострадали 35 человек. У одного из пострадавших болельщиков сборной Англии, как сообщали российские дипломаты, была зафиксирована смерть мозга. По подозрению в причастности к дракам французская полиция задержала несколько десятков российских болельщиков, не менее 20 из них были депортированы. Трое россиян были приговорены к тюремным срокам. Морозов — к 12 месяцам лишения свободы, Горбачев — к 18 месяцам, а Ерунов — к 24 месяцам тюрьмы.",
        "source_url": "https://meduza.io/news/2016/12/22/vo-frantsii-osvobozhden-osuzhdennyy-za-besporyadki-na-evro-2016-rossiyskiy-bolelschik"
    },
    {
        "rima_id": 647147,
        "slug": "2017-10-11-meduza-707617-press-sekretar-roskomnadzora-stal-figurantom-dela-o",
        "source_slug": "meduza",
        "title": "Пресс-секретарь Роскомнадзора стал фигурантом дела о мошенничестве",
        "mapped_genre": "Новости",
        "published_dt": "2017-10-11 19:27:24+00",
        "plain_text": "Пресс-секретарь Роскомнадзора Вадим Ампелонский стал фигурантом дела о мошенничестве (часть 4 статьи 159 УК РФ), сообщает издание vc.ru со ссылкой на источник, знакомый с ситуацией. Пресс-служба Чертановского районного суда подтвердила «Интерфаксу» эту информацию. Согласно карточке на сайте суда, 5 октября было рассмотрено и отклонено ходатайство об аресте Ампелонского. По данным источника «Интерфакса», Ампелонский и другой фигурант дела, руководитель правового отдела Роскомнадзора Борис Едидин находятся под подпиской о невыезде и надлежащем поведении. Подробности дела пока неизвестны. Vc.ru пишет, что 10 октября в телеграм-канале «Опер слил» появилась информация об обысках в подведомственном Роскомнадзору предприятии «Главный радиочастотный центр». Помимо Ампелонского и Едидина по делу проходит глава аппарата Роскомнадзора Александр Весельчаков, он находится под домашним арестом. Глава Роскомнадзора Александр Жаров отказался комментировать «Интерфаксу» информацию о деле в отношении своих подчиненных. В министерстве связи и массовых коммуникаций заявили ТАСС, что не знают о деле. По словам источника vc.ru, Ампелонский не выходит на работу уже неделю. «Медуза» позвонила чиновнику; в ответ прозвучало сообщение, что «номер не используется». В последние дни Ампелонский также не отвечал «Медузе» на сообщения в фейсбуке.",
        "source_url": "https://meduza.io/news/2017/10/11/vs-ru-press-sekretar-roskomnadzora-stal-figurantom-dela-o-moshennichestve"
    },
    {
        "rima_id": 598498,
        "slug": "2021-04-26-meduza-271041-velikobritaniia-vvela-sanktsii-protiv-14-rossiian-iz-za-dela",
        "source_slug": "meduza",
        "title": "Великобритания ввела санкции против 14 россиян из-за дела Магнитского",
        "mapped_genre": "Новости",
        "published_dt": "2021-04-26 21:23:48+00",
        "plain_text": "Великобритания ввела санкции против 14 граждан РФ, которые, по мнению властей страны, связаны с делом Магнитского и причастны к хищениям из российского бюджета. Как сообщается на сайте МИД Великобритании, ограничения введены за «хищение суммы, эквивалентной 230 миллионам долларов госсредств РФ, путем мошеннической схемы с возвратом налогов, осуществленной в 2007 году». В санкционный список, в частности, попали инициатор дела против юриста Сергея Магнитского, бывший сотрудник МВД Артем Кузнецов и бывший следователь Павел Карпов, который вел дело Магнитского. Помимо них, в списке оказались еще несколько бывших следователей, сотрудников ФНС, директоров компаний и бизнесменов, связанных с этим делом. Закон о борьбе с отмыванием денег, принятый в 2017 году, предусматривает санкции против иностранных граждан и организаций, которые власти Великобритании считают причастными к коррупционным преступлениям. Попавшим под санкции людям запрещен въезд в Великобританию, а их активы на территории страны замораживаются. В июле 2020 года Великобритания в рамках этого закона ввела санкции против 25 россиян. В их числе оказался глава Следственного комитета Александр Бастрыкин.",
        "source_url": "https://meduza.io/news/2021/04/26/velikobritaniya-vvela-sanktsii-protiv-14-rossiyan-iz-za-dela-magnitskogo"
    },
    {
        "rima_id": 599216,
        "slug": "2017-05-31-meduza-189663-usmanov-na-sude-s-naval-nym-pred-iavil-spravku-ob-uplate",
        "source_slug": "meduza",
        "title": "Усманов на суде с Навальным предъявил справку об уплате налогов в России. Опровергая свою же пресс-службу",
        "mapped_genre": "Новости",
        "published_dt": "2017-05-31 13:26:18+00",
        "plain_text": "Представители миллиардера Алишера Усманова показали в Люблинском суде Москвы справки о том, что предприниматель в 2015 и 2016 годах был налоговым резидентом России. Документы опубликовал политик Алексей Навальный, против которого Усманов подал иск о защите чести и достоинства. Справки выданы российской Федеральной налоговой службой только 18 мая 2017 года и адресованы швейцарским налоговым органам. В документах говорится, что Усманов последние два года был налоговым резидентом России, а значит не обязан повторно платить налоги в Швейцарии. Как отмечает Навальный, представленные справки из ФНС противоречат заявлениям пресс-службы USM Holdings, которая управляет активами Усманова. В 2016 году представители компании рассказывали РБК и Forbes , что миллиардер с 2015 года проводит за границей больше половины своего времени, а значит перестал быть налоговым резидентом России. Никто не знает, Усманов подавал в суд на свою пресс-службу? Навальный Налоговое резидентство Усманова обсуждается в Люблинском суде из-за того, что в октябре 2016 года Навальный записал ролик , где рассказывал, как «богатейший человек России» платит налоги за рубежом. Сам Усманов в обращении к Навальному заявил , что за 2016 год задекларировал в России 2,7 миллиарда рублей налогов. Судебное разбирательство по иску Усманова к Навальному началось 30 мая. Миллиардер требует опровергнуть заявления Навального о том, что он дарил знакомым премьер-министра Дмитрия Медведева собственность на Рублевке и давал взятку первому вице-премьеру Игорю Шувалову. Усманов лично не принимает участия в процессе.",
        "source_url": "https://meduza.io/news/2017/05/31/usmanov-na-sude-s-navalnym-pred-yavil-spravku-ob-uplate-nalogov-v-rossii-oprovergaya-svoyu-zhe-press-sluzhbu"
    },
    {
        "rima_id": 604065,
        "slug": "2017-05-23-meduza-393392-stiven-sigal-snimetsia-v-realiti-shou-o-poluchenii-dal",
        "source_slug": "meduza",
        "title": "Стивен Сигал снимется в реалити-шоу о получении «дальневосточного гектара». ВГТРК это опровергло",
        "mapped_genre": "Новости",
        "published_dt": "2017-05-23 09:50:38+00",
        "plain_text": "Обновление. Агент Сигала Анар Рейбанд заявил , что имя актера для анонса шоу использовали без его согласия, так как «если что-то находится на уровне идеи, нельзя это подавать как конкретный проект». ВГТРК также опровергло подготовку проекта на «России 1». Голливудский актер с российским паспортом Стивен Сигал снимется в реалити-шоу канала «Россия 1» о получении «дальневосточного гектара». В администрации Приморского края рассказали, что в проекте подробно опишут все этапы оформления земли. На своем участке Сигал планирует построить многофункциональный спорткомплекс и культурный центр, рассказал представитель компании-оператора телепроекта Илья Горбунов. С 1 февраля 2017 года любой россиянин может подать заявку на получение бесплатного гектара земли на Дальнем Востоке, ранее заявки могли подавать только жители региона. По состоянию на конец мая 2017 года было подано более 90 тысяч заявок, из них почти 17 тысяч уже удовлетворили. Стивен Сигал стал гражданином России в ноябре 2016 года, американец также является гражданином Сербии.",
        "source_url": "https://meduza.io/news/2017/05/23/stiven-sigal-snimetsya-v-realiti-shou-o-poluchenii-dalnevostochnogo-gektara"
    },
    {
        "rima_id": 607269,
        "slug": "2014-11-07-meduza-803272-kurs-rublia-rezko-vyros-na-slukhakh-ob-ekstrennom",
        "source_slug": "meduza",
        "title": "Курс рубля резко вырос на слухах об экстренном совещании ЦБ",
        "mapped_genre": "Новости",
        "published_dt": "2014-11-07 16:08:20+00",
        "plain_text": "Курс рубля на Московской бирже после утреннего падения резко вырос во второй половине дня. Причиной его укрепления называют слухи об экстренном совещании Центробанка РФ, на котором якобы обсуждаются дополнительные валютные интервенции. После открытия торгов 7 ноября доллар и евро установили новые исторические рекорды, поднявшись до 48,64 и 60,27 рубля соответственно. Во второй половине дня доллар подешевел примерно на 2,2 рубля, евро — почти на 3 рубля. «Прошел слух, что в ЦБ идет экстренное совещание. Поэтому рынок готовится, что ЦБ выйдет с внеплановыми интервенциями», — сообщил трейдер инвестбанка «Ренессанс Капитал» Левон Атанасян. ПРАЙМ С 5 ноября Центробанк ограничил максимальный объем валютных интервенций суммой $350 млн. При этом он предупредил, что оставляет за собой право на масштабные интервенции в случае возникновения угроз финансовой стабильности. В течение октября ЦБ потратил на поддержку рубля около $30 млрд. Причиной быстрого падения курса рубля называют снижение мировых цен на нефть, замедление российской экономики и западные санкции, введенные против России в связи с конфликтом на Украине.",
        "source_url": "https://meduza.io/news/2014/11/07/kurs-rublya-rezko-vyros-na-sluhah-ob-ekstrennom-soveschanii-tsb"
    },
    {
        "rima_id": 604155,
        "slug": "2022-10-24-meduza-951778-administratsiia-kurskoi-oblasti-prizvala-glav-raionnykh",
        "source_slug": "meduza",
        "title": "Администрация Курской области призвала глав районных центров готовить окопы на случай обстрелов",
        "mapped_genre": "Новости",
        "published_dt": "2022-10-24 18:49:43+00",
        "plain_text": "Глава комитета региональной безопасности Курской области Михаил Горбунов заявил о необходимости строительства укрытий на случай обстрела в сельских поселениях и районных центрах. Запись оперативного совещания опубликована на странице администрации области во «ВКонтакте». «Что касается территорий, где люди посещают ФАПы , почту, банки, магазины, у них нет там подвальных помещений. Рядом должны быть оборудованы укрытия. Элементарное укрытие — это выкопанный окоп. Обустройте их. Мы уже об этом говорили. Образцы, фотографии мы вам пришлем, но это сделать несложно: на дно положить поддоны, выкопать, обустроить стенки, обложить мешками, чтобы люди могли укрыться. Потому что ФАПы у нас легкой конструкции. Все это осколками прошьет насквозь. Там не укроешься», — сказал Горбунов. Также глава комитета отчитался о проведении работ по очистке «заглубленных помещений подземного пространства». По его словам, в подвалах и подобных помещениях Курской области может укрыться до полутора миллиона человек. Помимо этого, губернатор Роман Старовойт сообщил об усилении контроля на основных магистралях и в приграничных районах области, в том числе меры безопасности были усилены в городе Курчатов, где расположена Курская атомная электростанция. Курская область, как и другие приграничные с Украиной территории, регулярно оказывается под обстрелом. Последний подобный случай произошел 18 октября. Тогда, по словам губернатора Романа Старовойта, было более шести взрывов. «Снаряды попали в сгоревший ранее жилой дом, остальные удары легли в огороды», — заявил он. В результате обстрела пострадала местная жительница —осколки стекла попали ей в лицо. Старовойт 23 октября сообщил , что в регионе завершилось строительство двух усиленных линий обороны. Их создали совместно с министерством обороны России и пограничным управлением ФСБ по Курской области. По словам губернатора, до 5 ноября в регионе появится третья линия обороны. Днем ранее губернатор Белгородской области Вячеслав Гладков отчитался о начале строительства в области оборонительных сооружений из бетонных блоков. Аналогичные укрепления ЧВК Вагнера размещает в аннексированной Луганской области.",
        "source_url": "https://meduza.io/news/2022/10/24/administratsiya-kurskoy-oblasti-prizvala-glav-rayonnyh-tsentrov-gotovit-okopy-na-sluchay-obstrela"
    },
    {
        "rima_id": 609398,
        "slug": "2014-11-24-meduza-227631-soiuz-pristykovalsia-k-mks",
        "source_slug": "meduza",
        "title": "«Союз» пристыковался к МКС",
        "mapped_genre": "Новости",
        "published_dt": "2014-11-24 07:02:47+00",
        "plain_text": "Корабль «Союз» пристыковался к Международной космической станции. Стыковка произошла в 5:48 по московскому времени. В 7:30 были открыты переходные люки между «Союзом» и модулем «Рассвет» МКС. Ракету с кораблем «Союз» запустили 24 ноября в 00:01 по московскому времени. Стыковка осуществлялась по укороченной программе. Перед ней корабль совершил всего четыре витка вокруг Земли. На орбиту прибыли трое космонавтов: россиянин Антон Шкаплеров, итальянка Саманта Кристофоретти из Европейского космического агентства и Терри Вертс из NASA. Они присоединились к Александру Самокутяеву, Елене Серовой и Барри Уилмору. Новый экипаж пробудет на орбите 169 суток. За это время космонавты проведут 59 экспериментов в различных областях, таких как космическая биотехнология, медико-биологические исследования, дистанционное зондирование Земли и другие. Во время пребывания экипажа МКС-42/43 запланированы работы с транспортными грузовыми кораблями «Прогресс М-25М», «Прогресс М-26М», «Прогресс М-27М», европейским грузовым кораблём ATV-5 «Georges Lemaitre» и японским грузовым кораблем HTV-5 «Kounotori». Роскосмос",
        "source_url": "https://meduza.io/news/2014/11/24/soyuz-pristykovalsya-k-mks"
    },
    {
        "rima_id": 655730,
        "slug": "2020-08-26-meduza-62616-sait-mgu-soobshchil-o-zachislenii-na-biudzhet-docheri-igoria",
        "source_slug": "meduza",
        "title": "Сайт МГУ сообщил о зачислении на бюджет дочери Игоря Шувалова. Она набрала на экзаменах на 100 баллов меньше, чем другие поступившие",
        "mapped_genre": "Новости",
        "published_dt": "2020-08-26 14:51:40+00",
        "plain_text": "Анастасия Шувалова, полная тезка дочери бывшего вице-премьера и председателя ВЭБа Игоря Шувалова, оказалась в списке зачисленных на бюджетное отделение на факультет психологии МГУ, хотя на ЕГЭ она набрала намного меньше баллов, чем остальные зачисленные абитуриенты. Об этом сообщает Forbes. Список зачисленных абитуриентов на специальность «клиническая психология» был опубликован на сайте МГУ 24 августа. В нем оказалось 37 человек. У 36 из них в сумме за четыре экзамена (ЕГЭ по биологии, математике и русскому языку, а также дополнительный экзамен по биологии в МГУ) было от 334 до 391 балла, у Шуваловой — только 230 баллов. После того как Forbes обратился за комментарием в МГУ, Шувалову убрали из списка на сайте. Самому изданию в пресс-службе вуза заявили, что она попала туда «случайно» и что на самом деле она зачислена на платной основе — для этого было достаточно набрать 203 балла. Обновление. Первоначально Forbes называл Анастасию Шувалову «полной тезкой» дочери Игоря Шувалова, но затем исправил материал, став называть ее «дочерью Шувалова». В пресс-службе ВЭБ.РФ изданию сообщили, что дочь Игоря Шувалова зачислена на факультет психологии МГУ на коммерческой основе. Игорь Шувалов закончил юридический факультет МГУ в 1993 году.",
        "source_url": "https://meduza.io/news/2020/08/26/sayt-mgu-soobschil-o-zachislenii-na-byudzhet-polnoy-tezki-docheri-igorya-shuvalova-ona-nabrala-na-ekzamenah-na-100-ballov-menshe-chem-drugie-postupivshie"
    }
]

import pandas as pd
import psycopg2.extras
from uuid import uuid4
from ner.pullenti_client.pullenti_analyzer import PullentiAnalyzer

psycopg2.extras.register_uuid()

PULLENTI_CONFIG = {"host": "localhost", "port": 8081}
PSYCOPG2_CONFIG = {
    "dbname": "ono_db",
    "user": "server",
    "password": "server",
    "host": "3.72.67.220",
    "port": 5432
}

INSERT_ARTICLE_SQL = "INSERT INTO article(article_id, rima_article_id, title, plain_text, published_dt) VALUES(%s, %s, %s, %s, %s);"
INSERT_ENTITY_SQL = "INSERT INTO entity(entity_id, tag, name) VALUES(%s, %s, %s);"
INSERT_ENTITY_ATTR_SQL = "INSERT INTO entity_attribute(entity_id, key, value) VALUES(%s, %s, %s);"
INSERT_ARTICLE_X_ENTITY_SQL = "INSERT INTO article_x_entity(article_id, entity_id) VALUES(%s, %s);"

concat = lambda e: f"{e.firstname} {e.lastname}"
connection = psycopg2.connect(**PSYCOPG2_CONFIG)
cursor = connection.cursor()

for article in source_data:
    analyzer = PullentiAnalyzer(article["title"], [], PULLENTI_CONFIG)
    ner_data: pd.DataFrame = pd.concat([
        analyzer.data("GEO"),
        analyzer.data("ORGANIZATION"),
        analyzer.data("PERSON")
    ])

    print(article["rima_id"])

    if not ner_data.shape[0]:
        continue

    article_id = uuid4()
    article = (article_id,
               article["rima_id"],
               article["title"],
               article["plain_text"],
               article["published_dt"])
    cursor.execute(INSERT_ARTICLE_SQL, article)

    for idx, row in ner_data.iterrows():
        entity_id = uuid4()
        entity_name = concat(row) if row.tag == "PERSON" else row["name"]

        entity = (entity_id,
                  row.tag,
                  entity_name)
        cursor.execute(INSERT_ENTITY_SQL, entity)

        for k, v in row.items():
            if k not in ["name", "tag"] and type(v) != float:
                entity_attrs = (
                    entity_id,
                    k,
                    v)
                cursor.execute(INSERT_ENTITY_ATTR_SQL, entity_attrs)

        article_x_entity = (
            article_id,
            entity_id)
        cursor.execute(INSERT_ARTICLE_X_ENTITY_SQL, article_x_entity)

    connection.commit()
